/* Farsi (Persian) locals for flatpickr */
import l10n from "./default";

l10n.weekdays = {
    shorthand: ["یک", "دو", "سه", "چهار", "پنج", "آدینه", "شنبه"],
    longhand: ["یک‌شنبه", "دوشنبه", "سه‌شنبه", "چهارشنبه", "پنچ‌شنبه", "آدینه", "شنبه"]
};

l10n.months = {
    shorthand: ["ژانویه", "فوریه", "مارس", "آوریل", "مه", "ژوئن", "ژوئیه", "اوت", "سپتامبر", "اکتبر", "نوامبر", "دسامبر"],
    longhand: ["ژانویه", "فوریه", "مارس", "آوریل", "مه", "ژوئن", "ژوئیه", "اوت", "سپتامبر", "اکتبر", "نوامبر", "دسامبر"]
};

l10n.ordinal = () => {
    return "";
};
