/* Macedonian locals for flatpickr */
import l10n from "./default";

l10n.weekdays = {
    shorthand: ["Не", "По", "Вт", "Ср", "Че", "Пе", "Са", "Не"],
    longhand: ["Недела", "Понеделник", "Вторник", "Среда", "Четврток", "Петок", "Сабота", "Недела"]
};

l10n.months = {
    shorthand: ["Јан", "Фев", "Мар", "Апр", "Мај", "Јун", "Јул", "Авг", "Сеп", "Окт", "Ное", "Дек"],
    longhand: ["Јануари", "Февруари", "Март", "Април", "Мај", "Јуни", "Јули", "Август", "Септември", "Октомври", "Ноември", "Декември"]
};

l10n.firstDayOfWeek = 1;
l10n.weekAbbreviation = "Нед.";
l10n.rangeSeparator = " до ";
