/* Thai locals for flatpickr */
import l10n from "./default";

l10n.weekdays = {
    shorthand: ["อา", "จ", "อ", "พ", "พฤ", "ศ", "ส"],
    longhand: ["อาทิตย์", "จันทร์", "อังคาร", "พุธ", "พฤหัสบดี", "ศุกร์", "เสาร์"]
};

l10n.months = {
    shorthand: ["ม.ค.", "ก.พ.", "มี.ค.", "เม.ย.", "พ.ค.", "มิ.ย.", "ก.ค.", "ส.ค.", "ก.ย.", "ต.ค.", "พ.ย.", "ธ.ค."],
    longhand: ["มกราคม", "กุมภาพันธ์", "มีนาคม", "เมษายน", "พฤษภาคม", "มิถุนายน", "กรกฎาคม", "สิงหาคม", "กันยายน", "ตุลาคม", "พฤศจิกายน", "ธันวาคม"]
};

l10n.firstDayOfWeek = 1;
l10n.rangeSeparator = " ถึง ";
l10n.scrollTitle = "เลื่อนเพื่อเพิ่มหรือลด";
l10n.toggleTitle = "คลิกเพื่อเปลี่ยน";

l10n.ordinal = () => {
    return "";
};
